{
  "career_advice_from_teacher": [
    "Always be curious and never stop learning.",
    "Find a career that aligns with your passions.",
    "Networking is key to building your career.",
    "Don't be afraid to take risks and try new things.",
    "Seek mentors who can guide you and offer advice.",
    "Embrace challenges as opportunities for growth.",
    "Develop strong communication skills.",
    "Be proactive and take initiative in your work.",
    "Stay organized and manage your time effectively.",
    "Continuously improve your skills and knowledge.",
    "Be adaptable and open to change.",
    "Work hard, but also take care of your well-being.",
    "Build a professional online presence.",
    "Learn from your mistakes and failures.",
    "Set clear goals and work towards achieving them.",
    "Maintain a positive attitude, even during tough times.",
    "Stay updated with industry trends and developments.",
    "Value teamwork and collaborate effectively with others.",
    "Be persistent and don't give up easily.",
    "Develop a strong work ethic and be reliable.",
    "Always be willing to learn from others.",
    "Seek feedback and use it to improve.",
    "Build a diverse skill set to enhance your employability.",
    "Stay motivated and driven to achieve your dreams.",
    "Be professional in your conduct and appearance.",
    "Cultivate good relationships with your colleagues.",
    "Be open to constructive criticism.",
    "Balance work and personal life effectively.",
    "Be innovative and think outside the box.",
    "Find a mentor who inspires and challenges you.",
    "Be honest and maintain integrity in your work.",
    "Always strive for excellence.",
    "Take responsibility for your actions and decisions.",
    "Stay passionate about your career.",
    "Be patient and persistent in pursuing your goals.",
    "Learn to manage stress and stay resilient.",
    "Keep a positive outlook, even during setbacks.",
    "Seek opportunities to grow and advance in your career.",
    "Be confident in your abilities.",
    "Never stop seeking knowledge and self-improvement."
  ]
}
